//----------------------------------------------------------------------
// Copyright (C) 2003-2023 烟台东方威思顿电气股份有限公司电表低压台区产品部
// 创建人
// 创建日期
// 描述
// 修改记录
//----------------------------------------------------------------------
#ifndef __MIDLAYER_API_H
#define __MIDLAYER_API_H

//-----------------------------------------------
//				宏定义
//-----------------------------------------------
#define MODULE_EVENT_NUM        (10)
#define PARA_SAVE_SIZE        (1024)
//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

typedef struct OI_OIMapping_t
{
    WORD Event_Save_OI[MODULE_EVENT_NUM];
    WORD Event_Really_OI[MODULE_EVENT_NUM];
    WORD Para_Save_OI[MODULE_EVENT_NUM];
    WORD Para_Really_OI[MODULE_EVENT_NUM];
    DWORD CRC;
}TMOD_EVENT_OI_OIMapping;
typedef enum{
	eParaMap,
	eEventMap
}eMappingType;

typedef enum{
	eModuleOrdOI=BIT0,
	eModuleEventOI=BIT1,
    eModuleParaOI=BIT0+BIT7,
    eModuleAllOI=0xff
}eModuleOIType;
//-----------------------------------------------
//				变量声明
//-----------------------------------------------

extern BYTE ModuleEventBuf[0x304];
//-----------------------------------------------
// 				函数声明
//-----------------------------------------------

//-----------------------------------------------
// 函数功能: 初始化
//
// 参数: 	无
//
// 返回值:   无
//
// 备注:   完成函数注册
//-----------------------------------------------
void api_MidLayerInit(void);

//-----------------------------------------------
// 函数功能: 任务函数
//
// 参数: 	无
//
// 返回值:   无
//
// 备注:   执行多个任务函数
//-----------------------------------------------
void api_MidLayerTask(void);
//--------------------------------------------------
// 功能描述:  获取拓展模块数据
//
// 参数:
//
// 返回值:
//
// 备注:
//--------------------------------------------------
BYTE api_RequestModule(BYTE *APDU, BYTE APDULen, WORD BufLen);
//--------------------------------------------------
// 功能描述:  扩展透传报文
//
// 参数:
//
// 返回值:
//
// 备注:
//--------------------------------------------------
BYTE api_ExtAgencyPro(BYTE *APDU, BYTE APDULen, WORD BufLen);
//--------------------------------------------------
// 功能描述:返回数据长度
//
// 参数:	BYTE *OAD    OAD/ROAD
//			BYTE size    OAD/ROAD字节数
//			BYTE DataType
//			
// 返回值:
//
// 备注:
//--------------------------------------------------
WORD GetOILen(BYTE *OAD,BYTE DataType, BYTE size);
//--------------------------------------------------
// 功能描述:  判断是否为拓展模块OI
//
// 参数:      WORD OI
//
// 返回值:    BOOL
//
// 备注:
//--------------------------------------------------
BOOL IsModuleOI(WORD OI,eModuleOIType ModuleOIType);
//--------------------------------------------------
//功能描述:  处理模块事件
//         
//参数:  BYTE* pOMD
//         
//返回值:   
//         
//备注:  
//--------------------------------------------------
BYTE  ModuleEventFunc( BYTE Ch,BYTE* pOMD );
//--------------------------------------------------
// 功能描述:  初始化ee中的对应关系参数
//
// 参数:
//
// 返回值:
//
// 备注:
//--------------------------------------------------
BOOL api_ModparaInit(void);
//--------------------------------------------------
// 功能描述:  获取对应存储OI
//
// 参数:		WORD *OI,
//				BYTE Type	若不存在 0返回0xff	1创建后返回对应OI
//
// 返回值:
//
// 备注:
//--------------------------------------------------
BYTE FindThisEventSaveOI(WORD *OI, BYTE Type,eMappingType MappingType);
//--------------------------------------------------
// 功能描述:  获取对应真实OI
//
// 参数:		WORD *OI,
//
// 返回值:  模块设计序号
//
// 备注:
//--------------------------------------------------
BYTE FindThisEventReallyOI(WORD *OI);

#endif //__MIDLAYER_API_H