#ifndef __SYSDESCRIBE_H
#define __SYSDESCRIBE_H

#define MAX_VERSION		16

//*************************************************
//                  表类型及功能描述
//*************************************************

//-----------------------------------------------
//函数功能: 读电表版本
//
//参数:		Buf[out] 输出缓冲
//						
//返回值:	无
//		   
//备注:
//-----------------------------------------------
WORD api_ReadMeterVersion(BYTE *Buf);

//-----------------------------------------------
//函数功能: 获取对应类型版本
//
//参数: 	Type[in]	对应类型
//                    
//返回值:  	版本信息
//
//备注: 
//-----------------------------------------------
WORD api_GetMeterVersion(BYTE Type);

//-----------------------------------------------
//函数功能: 版本管理模块上电初始化函数
//
//参数: 	无
//                    
//返回值:  	无
//
//备注:   
//-----------------------------------------------
void api_PowerUpVersion( void );
//-----------------------------------------------
//函数功能:	获取OAD对应的地址
//
//参数:	pBuf[in/out]
//
//返回值:	
//
//备注:	方便测试组测试
//-----------------------------------------------
#if( MAX_PHASE == 3 )
WORD api_GetDefaultConstParaAdder(WORD Num, BYTE* pBuf);
#endif

#endif//__SYSDESCRIBE_H


