//----------------------------------------------------------------------
//Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部 
//创建人	
//创建日期	
//描述		头文件
//修改记录	
//----------------------------------------------------------------------
#ifndef __ALGO_H
#define __ALGO_H
#include "TaskFun.h"
#if(USE_EBIDF)
#include "eb_Thread.h"
#endif
#include "nilm_thread.h"
//-----------------------------------------------
//				宏定义
//-----------------------------------------------
#define INTER_CYCLE					G_SAMPLE_NUM	//一个周波128点
//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------
#if(PROTOCOL_VERSION == 25)
extern rt_mq_t mq_UnkDevFeature;
extern rt_mq_t mq_DeviceInfo;
extern rt_mq_t mq_WaveData;
#endif
extern BYTE AbnormFlag[MAX_PHASE];									//异常标志
//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
#if(PROTOCOL_VERSION == 25)
void vCreateTasktoSaveFreezeEvent(void);
void CreateMqtoEvent ( void );
//--------------------------------------------------
//功能描述:  添加309A或者309B事件信息 算法提供真实数据，负责逻辑实现
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_AdditionInfo( WORD OI );

//--------------------------------------------------
//功能描述:  等待算法真实接口
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
BYTE set_freeze_period(WORD period); 
#endif //#if(PROTOCOL_VERSION == 25)

#if(USE_EBIDF)
//--------------------------------------------------
//功能描述:  电动车标志删除处理
//         
//参数:      Phase == 0/1/2,分别初始化单一相
//			 phase == 其他，初始化所有相
//          Num 是第几个，Num是最大值时候清除全部
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_EBResDeleteIndex( BYTE Phase,BYTE Num );
//--------------------------------------------------
//功能描述:  电动车标志存储处理
//         
//参数:      Tpye = 0是添加，等于1是删除
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void api_EBResAddIndex(BYTE Phase);
#endif
//功能描述:  波形回放前，先初始化
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void api_VariableInit( void );
//--------------------------------------------------
//功能描述:  创建算法任务
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void api_CreateNILMTask(void);
#endif //#ifndef __ALGO_H



