//----------------------------------------------------------------------
//Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部 
//创建人	
//创建日期	
//描述		头文件
//修改记录	
//----------------------------------------------------------------------
#ifndef __EB_THREAD_H
#define __EB_THREAD_H

#if(USE_EBIDF)
#include "eb_Processing.h"
//-----------------------------------------------
//				宏定义
//-----------------------------------------------
#define EB_FLAG_COUNT				(3600+4)		//代表3600+4s,怕NILM任务有卡顿，因此多冗余4s
#define WAVE_LEN					50 				//50个周波
#define EB_MINPDIFF					40				//电动车识别有功功率变换与起始功率激增差值的阈值
#define EB_MINDDIFF                 50              //电动车识别畸变功率变换与起始功率激增差值的阈值
//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------
extern int EbCount_features_002s;
extern float latestU[MAX_PHASE][CYCLES_POINT_10*G_SAMPLE_NUM]; 		//缓存10周波UA
extern float latestI[MAX_PHASE][CYCLES_POINT_10*G_SAMPLE_NUM]; 		//缓存10周波IA
//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
//--------------------------------------------------
//功能描述:  信号线程初始化
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void EBProcInit(void);
//--------------------------------------------------
//功能描述:  NILM任务函数
//         
//参数:      
//         
//返回值:    
//         
//备注:  需要4K空间
//--------------------------------------------------
void EBThreadEntry(void);
//--------------------------------------------------
//功能描述:  数据拷贝
//         
//参数:      
//         
//返回值:    
//         
//备注:  需要4K空间
//--------------------------------------------------
void EBDataCopy(float* U_data, float* I_data);
//--------------------------------------------------
//功能描述:  电动车算法参数初始化
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  EBParaInit( void );
//--------------------------------------------------
//功能描述:  计算差分
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  CalDiff(float *Data,BYTE Step,BYTE Len, float *Out);
#endif //#if(USE_EBIDF)
#endif //#__EB_THREAD_H