//----------------------------------------------------------------------
//Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部
//创建人	
//创建日期	
//描述		
//修改记录
//----------------------------------------------------------------------
#include "wsd_def.h"	
//-----------------------------------------------
//			本文件使用的宏定义
//-----------------------------------------------
#if(CYCLE_REPORT_PROTOCAL == PROTOCOL_104)
//-----------------------------------------------
//		本文件使用的结构体，共用体，枚举
//-----------------------------------------------
//数据上报名称 和 对应枚举值
typedef struct TReportData_t
{
	WORD wLabel;
	eValueType ValueType;
	BYTE point;
}TReportData;

//-----------------------------------------------
//				全局使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				本文件使用的变量，常量		
//-----------------------------------------------
//104协议上报数据
TReportData ReportData[]  = 
{
	{0x4001,ePActiveAll,4},				//正向有功总电能
	{0x4002,eNActiveAll,4},				//反向有功总电能
	{0x4003,eRActive1All,4},			//组合无功1总电能
	{0x4004,eRActive2All,4},			//组合无功2总电能
	{0x4005,eUa,4},						//A相电压	
	{0x4006,eUb,4},						//B相电压
	{0x4007,eUc,4},						//C相电压
	{0x4008,eIa,4},						//A相电流
	{0x4009,eIb,4},						//B相电流
	{0x4010,eIc,4},						//C相电流
	{0x4011,eIzs,4},					//零序电流
	{0x4012,eP1,4},						//总有功
	{0x4013,eP2,4},						//A相有功
	{0x4014,eP3,4},						//B相有功
	{0x4015,eP4,4},						//C相有功
	{0x4016,eQ1,4},						//总无功
	{0x4017,eQ2,4},						//A相无功
	{0x4018,eQ3,4},						//B相无功
	{0x4019,eQ4,4},						//C相无功
	{0x4020,ePF1,4},					//总功率因数
	{0x4021,ePF2,4},					//A相功率因数
	{0x4022,ePF3,4},					//B相功率因数
	{0x4023,ePF4,4},					//C相功率因数
};
//-----------------------------------------------
//				内部函数声明
//-----------------------------------------------

//-----------------------------------------------
//				函数定义
//-----------------------------------------------
//--------------------------------------------------
//功能描述:  周期上报 104格式
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  CycleReportData_104(double *Data, BYTE bSocket, BYTE bNum)
{
	float ftemp;
	BYTE Buf[256] = {0},i = 0;
	Buf[i++] = 0x68;
	i++;
	Buf[i++] = 0x04;//控制域 1,2,3,4
	Buf[i++] = 0x00;
	Buf[i++] = 0x00;
	Buf[i++] = 0x00;

	Buf[i++] = 0x0D;//类型标识
	Buf[i++] = sizeof(ReportData)/sizeof(TReportData);//信息对象数目
	Buf[i++] = 0x03;//传送原因
	Buf[i++] = 0x00;

	Buf[i++] = bAddr[5];//供公共地址  暂时取基表地址后两位
	Buf[i++] = bAddr[4];

	//信息体
	for (WORD j = 0; j < sizeof(ReportData)/sizeof(TReportData); j++)
	{
		memcpy(&Buf[i],&ReportData[j].wLabel,2);
		i = i+2;
		Buf[i++] = 0;
		ftemp = Data[ReportData[j].ValueType];
		memcpy(&Buf[i],(BYTE*)&ftemp,sizeof(float));
		nwy_ext_echo("\r\n %f",ftemp);
		i = i+4;
		Buf[i++] = 0;
	}
	Buf[1] = i-2;
	for (WORD K = 0; K < i; K++)
	{
		nwy_ext_echo("%02x ", Buf[K]);
	}
	Tcp_send(bSocket, (char*)&Buf[0], i,bNum);
}


#endif //#if(CYCLE_REPORT_PROTOCAL == PROTOCOL_104)