//----------------------------------------------------------------------
// Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部
// 创建人
// 创建日期
// 描述
// 修改记录
//----------------------------------------------------------------------
#include "wsd_def.h"
//-----------------------------------------------
//			本文件使用的宏定义
//-----------------------------------------------

//-----------------------------------------------
//		本文件使用的结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				全局使用的变量，常量
//-----------------------------------------------
TFlagBytes FlagBytesRam;					   // 标志变量
static BYTE SysStatus[MAX_SYS_STATUS_NUM / 8]; // UART内部标志 ，只给uart线程用
//-----------------------------------------------
//-----------------------------------------------

//-----------------------------------------------
//				本文件使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				内部函数声明
//-----------------------------------------------

//-----------------------------------------------
//				函数定义
//-----------------------------------------------
//--------------------------------------------------
// 功能描述:  给所有任务清除同一个标志
//
// 参数:
//
// 返回值:
//
// 备注:
//--------------------------------------------------
void api_ClrAllTaskFlagRam(void)
{
	memset(&FlagBytesRam.TaskTimeFlag[0], 0, sizeof(TFlagBytes));
}
//-----------------------------------------------
// 函数功能: 给所有任务置同一个标志
//
// 参数:
//			FlagID[in]		标志号
//
// 返回值:  	无
//
// 备注:
//-----------------------------------------------
void api_SetAllTaskFlagRam(BYTE FlagID)
{
	memset(&FlagBytesRam.TaskTimeFlag[FlagID % eFLAG_TIMER_T], 0xff, sizeof(FlagBytesRam.TaskTimeFlag[FlagID]));
}

//-----------------------------------------------
// 函数功能: 获取任务标志
//
// 参数:
//			TaskID[in]		任务号
//			FlagID[in]		标志号
//
// 返回值:  	TRUE:相应标志置位了  FALSE:相应标志未置位
//
// 备注:
//-----------------------------------------------
BOOL api_GetTaskFlag(TFlagBytes *FlagByte, BYTE TaskID, BYTE FlagID)
{
	if (FlagByte->TaskTimeFlag[FlagID] & ((DWORD)1 << TaskID))
	{
		return TRUE;
	}

	return FALSE;
}

//-----------------------------------------------
// 函数功能: 清除任务标志
//
// 参数:
//			TaskID[in]		任务号
//			FlagID[in]		标志号
//
// 返回值:  	无
//
// 备注:
//-----------------------------------------------
void api_ClrTaskFlag(TFlagBytes *FlagByte, BYTE TaskID, BYTE FlagID)
{
	FlagByte->TaskTimeFlag[FlagID % eFLAG_TIMER_T] &= ~((DWORD)1 << (TaskID));
}

//-----------------------------------------------
// 函数功能: 设置系统状态
//
// 参数:
//			StatusNo[in]		系统状态号
//
// 返回值:  	无
//
// 备注:
//-----------------------------------------------
void api_SetSysStatus(BYTE StatusNo)
{
	BYTE i, j;

	i = (StatusNo % eSYS_STATUS_NUM_T) / 8;
	j = StatusNo % 8;

	SysStatus[i] |= (0x01 << j);
}

//-----------------------------------------------
// 函数功能: 清除系统状态
//
// 参数:
//			StatusNo[in]		系统状态号
//
// 返回值:  	无
//
// 备注:
//-----------------------------------------------
void api_ClrSysStatus(BYTE StatusNo)
{
	BYTE i, j;

	i = (StatusNo % eSYS_STATUS_NUM_T) / 8;
	j = StatusNo % 8;

	SysStatus[i] &= ~(0x01 << j);
}

//-----------------------------------------------
// 函数功能: 获取系统状态
//
// 参数:
//			StatusNo[in]		系统状态号
//
// 返回值:  	TRUE:系统状态置位了 FALSE:系统状态未置位
//
// 备注:
//-----------------------------------------------
BOOL api_GetSysStatus(BYTE StatusNo)
{
	BYTE i, j;

	i = ((StatusNo % eSYS_STATUS_NUM_T) >> 3); // 相当于除以8
	j = (StatusNo & 0x07);					   // 相当于对8求模

	if ((SysStatus[i] & (0x01 << j)) != 0)
	{
		// 状态有效
		return TRUE;
	}

	// 状态无效
	return FALSE;
}