//----------------------------------------------------------------------
//Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部 
//创建人	
//创建日期	
//描述		DLT698头文件
//修改记录	
//----------------------------------------------------------------------
#ifndef __DLT698_H
#define __DLT698_H
#include "wsd_uart.h"

//-----------------------------------------------
//				宏定义
//-----------------------------------------------
	#define	MAX_PRO_BUF			(512)	//帧长度 通讯缓存apdu层最大尺寸

//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------
extern char MessageBuf[512];
//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
void  Send_Heartbeatframe_698( tTranData *transdata,BYTE bLink);
void DoSearch_68_DLT698(TSerial *p);
WORD JudgeDlt698_45_HCS_FCS(BYTE Type, TSerial *p);
WORD DoReceProc_Dlt698_UART(BYTE ReceByte, TSerial *p);
//--------------------------------------------------
//功能描述:  698 获取单个
//         
//参数:      OI   属性  索引
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_GetRequestNormal( WORD OI,BYTE attribute,BYTE index );
//--------------------------------------------------
//功能描述:  698读取若干个对象属性
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_GetRequestNormalList(void);
//--------------------------------------------------
//功能描述:  方法1读取冻结
//         
//参数:      DateTime[in] 指定时间 OadTable[in] 抄读OAD项
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_GetRequestRecordMethod1( BYTE *DateTime ,BYTE *OadTable);
#endif//#if( READMETER_PROTOCOL ==  PROTOCOL_698)

