//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	胡春华
//创建日期	2016.8.10
//描述		存储模块的接口文件
//修改记录	
//----------------------------------------------------------------------
#include "AllHead.h"
#include "at45db161.h"
#include "gd25q64c.h"
#include "SaveMem.h"

//-----------------------------------------------
//			本文件使用的宏定义
//-----------------------------------------------

//-----------------------------------------------
//		本文件使用的结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				全局使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				本文件使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				内部函数声明
//-----------------------------------------------

//-----------------------------------------------
//				函数定义
//-----------------------------------------------

//--------------------------------------------------
//功能描述:  对缓冲内的数据取反
//
//参数:      p[in] 			数据的缓冲
//
//           Length[in]		数据长度
//
//返回值:
//
//备注内容:  无
//--------------------------------------------------
void ReverseInData( BYTE *p, WORD Length )
{
	WORD i;
	for( i = 0; i < Length; i++ )
	{
		p[i] ^= 0xff;
	}
}



//-----------------------------------------------
//函数功能: 清安全空间,要求长度必须是结构的长度，包括校验在内，
//			而且安全空间的第二份是取反存储,校验固定认为是CRC32，该函数会自动添加校验
//
//参数: 
//			Addr[in]				起始地址
//			Length[in]				数据长度，整个结构的长度，包括校验
//                    
//返回值:  	TRUE:正确写入了两份数据	FALSE:有一份或两份数据没有正确写入
//
//备注:   
//-----------------------------------------------
WORD api_ClrSafeMem( WORD Addr, WORD Length )
{
	WORD Result;
	// 申请缓冲
	Result = Length;
	BYTE * pAllocBuf = api_AllocBuf( (WORD*)&Result );
	memset( pAllocBuf, 0x00, Length );
	Result = api_VWriteSafeMem( Addr, Length, pAllocBuf );
	api_FreeBuf( pAllocBuf );
	return Result;
}


//-----------------------------------------------
//函数功能: 管理存储模块的上电初始化工作
//
//参数: 	无
//                    
//返回值:  	无
//
//备注:   
//-----------------------------------------------
void api_PowerUpSave( void )
{
	InitEEPRom();
	
	#if( (THIRD_MEM_CHIP == CHIP_AT45DB161) || (THIRD_MEM_CHIP == CHIP_AT45DB321) )
	PowerUpResetExtFlash( 0 );
	#endif
}


