//----------------------------------------------------------------------
//Copyright (C) 2003-20XX 烟台东方威思顿电气有限公司电表软件研发部 
//创建人	
//创建日期	
//描述		头文件
//修改记录	
//----------------------------------------------------------------------
#ifndef _DLT212__H
#define _DLT212__H
//-----------------------------------------------
//				宏定义
//-----------------------------------------------
#define START_FRAME		6					//起始字符 Q 的位置
#define MAX_DATA_ITEM	50					//212环保协议 数据项最大个数
//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------
//环保协议解析
typedef struct TKeyValue_t
{
	char* key;
	char* value;
} TKeyValue;

// 解析后的数据结构
typedef struct TParsedFrame_t
{
	TKeyValue items[MAX_DATA_ITEM]; 
	int count;
} TParsedFrame;

//数据上报名称 和 对应枚举值
typedef struct TReportData_t
{
	char *dataname;
	eValueType ValueType;
	char point;
}TReportData;
//-----------------------------------------------
//				变量声明
//-----------------------------------------------

//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
//功能描述:  212协议 计算 报文校验
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
unsigned int CRC16_Checkout(unsigned char *puchMsg,unsigned int usDataLen);
//--------------------------------------------------
//功能描述:  将212格式报文 拆解 成数组形式
//         
//参数:      frame_str 传入字符串
//			TParsedFrame* pf  c传入结构体数组
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void ParseFrame_212(const char* frame_str,TParsedFrame* pf);
//--------------------------------------------------
//功能描述:  	212格式判断
//		 
//参数:	  
//		 
//返回值:	
//		 
//备注:  
//--------------------------------------------------
BOOL  DoReceProc_212( BYTE ReceByte ,char *pBuf);
//--------------------------------------------------
//功能描述:  212上行数据组帧
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
WORD  api_Compose211ReportFrame( TParsedFrame *pf ,char * inbuf ,double *Data);
//--------------------------------------------------
//功能描述:  释放资源函数
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void free_frame(TParsedFrame* pf);
//--------------------------------------------------
//功能描述:  组环保协议帧
//         
//参数:      pf[in] 			传入协议外壳 名称和数据项
//           inbuf[in]			传入缓存
//           DataItem[in] 		传入上报数据名称
//           Data[in] 			传入上报数据
//           item[in] 			传入上报数据项个数
//返回值:    
//         
//备注:  
//--------------------------------------------------
WORD  api_ComposeEnvirProtectFrame( TParsedFrame *pf ,char * inbuf ,TReportData *DataItem, double *Data ,BYTE item );
//--------------------------------------------------
//功能描述:  212协议 停上电 上报帧
//         
//参数:      bPower   1 停电 0 上电
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_PowerSwitchReportFrame( double bPower , tTranData *transdata);
//--------------------------------------------------
//功能描述:  
//         
//参数:      
//         
//返回值:    
//         
//备注:  
//--------------------------------------------------
void  api_CycleReportData( tTranData *transdata ,double *Data);
#endif //#ifndef _DLT212__H