//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	胡春华
//创建日期	2016.9.27
//描述		用于配置用户功能
//修改记录	
//----------------------------------------------------------------------
#ifndef __SYS_H
#define __SYS_H

//是否把程序选择为DEBUG版本，DEBUG版本支持ASSERT，否则不支持ASSERT
#define SEL_DEBUG_VERSION			NO

//板型定义  通过看印制板上的日期或图号选择相应的板型
#define BOARD_TYPE				BOARD_HC_MEASURINGSWITCH
//单相表
//BOARD_HT_SINGLE_78201662		11662//面向对象698规范单相表
//BOARD_HT_SINGLE_78201702		11702//面向对象698规范单相表 3.3v系统，带flash给江苏供货
//三相表
//BOARD_HT_THREE_0131037      	31037//6025+7038+698+模块
//BOARD_HT_THREE_0134566		34566//6025+7038+698+模块+ESAM电源可单独控制
//BOARD_HT_THREE_0131074		31074//6025+7038+698+（开关电源 或 485费控）
//BOARD_HT_THREE_0131699		31699//6025+7038+698+（开关电源 或 485费控）ESAM电源可单独控制
//BOARD_ST_THREE_0131212      	36983//面向对象698规范ST三相表(智能表)


#endif//对应文件最前面的#ifndef __SYS_H


