//----------------------------------------------------------------------
//Copyright (C) 2003-2016 烟台东方威思顿电气股份有限公司电表软件研发部
//创建人	张玉猛
//创建日期	2018.8.13
//描述		冻结模块内部头文件
//修改记录
//----------------------------------------------------------------------
#ifndef __FREEZE_H
#define __FREEZE_H
//--------------------------------------

//-----------------------------------------------
//				宏定义
//-----------------------------------------------

//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------
//-----------------------------------------------
//ReadNextPoint 方法2查询，先判断下一个冻结数据是否满足要求，从而节省每次二分法的时间。
//				0x00：		二分法查找冻结点
//				0x55:		读下一个冻结点
//ReadFlashFlag 方法2查询，会先读出时间，再读冻结数据。整合为一次读出，从而节省读Flash时间。
//				0x00：		从Flash中读出数据源
//				0x55:		采用传入的*pFreeData作为数据源
//-----------------------------------------------
typedef struct TFreezeData_t
{
	TDLT698RecordPara 		*pDLT698RecordPara;
	TFreezeDataInfo			*pDataInfo;
	BYTE					ReadNextPoint;		// 二分法标志
	BYTE					ReadFlashFlag;		// 读Flash标志
	BYTE					*pFreeData;			// 数据源指针
	BYTE					*pBuf;	
	BYTE					MinAttOadIndex;     // 要读分钟冻结对应的第几个属性
	BYTE					Tag;
	WORD					Len;
	DWORD					SearchTime;         // [out] 找到的时间
	DWORD					RecordNo;           // [out] 找到的序号
}TFreezeData; 

typedef struct  TFreezePara_t
{
	WORD	Cycle;				// 冻结周期
	DWORD	Oad;				// OAD属性标识特征的bit5~bit7有效
	DWORD	Depth;				// 存储深度
	WORD	Len;				// OAD数据的长度
	BYTE	Plan;				// OAD所属方案
	WORD	Offset;				// OAD数据在整条冻结里面的偏移地址（包含时标）
	WORD	PlanDataLen;		// 每个方案一条记录的数据长度
	DWORD	PlanOffset;			// 每个方案的首地址相对于整个冻结的偏移地址
}TFreezePara;




//-----------------------------------------------
//				变量声明
//-----------------------------------------------

//-----------------------------------------------
// 				函数声明
//-----------------------------------------------

#endif//对应文件最前面的#define __FREEZE_H
