//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	LiuZhenXing
//创建日期	2020.12.16
//描述		负荷识别模块EEPROM驱动程序
//修改记录	
//----------------------------------------------------------------------
#ifndef __M24512_H
#define __M24512_H
//-----------------------------------------------
//		本文件使用的结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				全局使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				本文件使用的变量，常量
//-----------------------------------------------

//------------------------------------------------
//        函数声明
//-------------------------------------------------
WORD ReadEEPRom1(WORD Addr, WORD Length, BYTE *Buf);
WORD ReadEEPRom2(WORD Addr, WORD Length, BYTE *Buf);
WORD WriteEEPRom1(WORD Addr, WORD Length, BYTE *Buf);
WORD WriteEEPRom2(WORD Addr, WORD Length, BYTE *Buf);
WORD ReadDoubleEEPRom(WORD Addr, WORD Length, BYTE *Buf1, BYTE *Buf2);
WORD WriteDoubleEEPRom(WORD Addr, WORD Length, BYTE *Buf);




#endif//#ifndef __M24512_H
