//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	胡春华
//创建日期	2016.8.10
//描述		断言程序，用于判断程序的非法运行情况。
//			提醒一下，断言打开的情况下，在源程序中插入一个换行也可能改变程序的校验码，因为断言的行号变了
//修改记录	
//----------------------------------------------------------------------
#include "AllHead.h"

//-----------------------------------------------
//			本文件使用的宏定义
//-----------------------------------------------

//-----------------------------------------------
//		本文件使用的结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				全局使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				本文件使用的变量，常量
//-----------------------------------------------

//-----------------------------------------------
//				内部函数声明
//-----------------------------------------------

//-----------------------------------------------
//				函数定义
//-----------------------------------------------
//-----------------------------------------------
//函数功能: 执行断言操作，记录异常事件并在液晶上提示
//
//参数: 
//			LineNo[in]	断言所在的行号
//			Record[in]	发生断言是否记录异常事件  0：不记录 1：记录
//                    
//返回值:  无
//
//备注:   
//-----------------------------------------------
void api_assert(WORD LineNo, BYTE Record)
{
#if( SEL_DEBUG_VERSION == YES )
	BYTE i;

	//在液晶上显示 “A-LineNo”
//	api_DisplayAssert( LineNo );

	//if( Record == 1 ) 调试版本情况下，不判断这个参数，都记录
	{
		//记录系统异常事件 assert异常事件
		api_WriteSysUNMsg(ASSERT_EVENT+LineNo);
	}
	
	//显示10秒后继续执行
//	for(i=0; i<100; i++)
//	{
//		api_Delayms( 100 );
//		CLEAR_WATCH_DOG;
//	}

	//for(;;);
	
#else//现场不打开断言的情况，只记录断言异常事件，液晶不显示。不建议进行复位操作，防止使用不当的情况造成总复位

	if( Record == 1 )
	{
		//记录系统异常事件 assert异常事件
		api_WriteSysUNMsg(ASSERT_EVENT+LineNo);
	}
	
#endif//#if( SEL_DEBUG_VERSION == YES )
}


