//----------------------------------------------------------------------
//Copyright (C) 2003-2016 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人    尹西科
//创建日期	2017年9月22日14:27:22
//描述		抄读事件
//修改记录
//----------------------------------------------------------------------

#include "AllHead.h"
#include "Dlt698_45.h"

#if( SEL_DLT645_2007 == YES )

//---------------------------------------------------------------
//函数功能: 读取事件记录
//
//参数: 
//                   
//返回值: 
//			DLT645_OK_00 - 正确返回
// 			DLT645_ERR_DATA_01 ~ DLT645_ERR_PRG_KEY_80  -  错误代码
// 			DLT645_NO_RESPONSE - 无需回复
//
//备注:   
//---------------------------------------------------------------
//WORD GetPro645RequestMeterEvent( DI, OutBufLen )
//{
	
//	return DLT645_OK_00;
//}


#endif//#if( SEL_DLT645_2007 == YES )
