//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	胡春华
//创建日期	2016.8.9
//描述		内存管理Api头文件
//修改记录	
//----------------------------------------------------------------------
#ifndef __MEMORY_API_H
#define __MEMORY_API_H
/*
//-----------------------------------------------
//				宏定义
//-----------------------------------------------

//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------

//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
//-----------------------------------------------
//函数功能: 初始化内存分配，获取堆的起始地址作为内存分配的开始地址
//
//参数: 无
//                    
//返回值:  无
//
//备注:   
//-----------------------------------------------
void api_InitAllocBuf(void);

//-----------------------------------------------
//函数功能: 申请缓冲
//
//参数: 
//	*BufSize[in]:	申请要分配内存的大小
//                    
//返回值:  申请内存的指针
//
//备注:当申请长度为0时，按照28个字节分配，出去后*BufSize还是为0
//		当申请长度大于COMMON_RAM_BUF_SIZE时，按照28个字节分配，出去后将*BufSize置为0   
//-----------------------------------------------
void *api_AllocBuf(WORD *BufSize);

//-----------------------------------------------
//函数功能: 释放缓冲
//
//参数: 
//	pBuf[in]:	要释放内存的指针，要释放的大小由内存管理自己负责
//                    
//返回值:  无
//
//备注:   
//-----------------------------------------------
void api_FreeBuf(void *pBuf);

//-----------------------------------------------
//函数功能: 缓冲检查，防止缓冲未释放，导致内存消耗完，在主循环调用
//
//参数: 无
//                    
//返回值:  	TRUE		缓冲检查正常，没有未释放的缓冲
//			FALSE		有未释放的缓冲
//
//备注:   
//-----------------------------------------------
BOOL api_CheckAllocBuf(void);
*/

#endif//#ifndef __MEMORY_API_H

