//----------------------------------------------------------------------
//Copyright (C) 2016-2026 烟台东方威思顿电气股份有限公司电表软件研发部 
//创建人	胡春华
//创建日期	2016.9.26
//描述		矩泉cpu三相表低功耗接口文件
//修改记录	
//----------------------------------------------------------------------
#ifndef __F460_LOWPOWER_THREE_H
#define __F460_LOWPOWER_THREE_H

#if( (CPU_TYPE == CPU_HC32F4A0) && (MAX_PHASE == 3) ) //暂时用cpu定义，可以考虑用单三相定义

//-----------------------------------------------
//				宏定义
//-----------------------------------------------
#define MAX_PORT_INT_NUM	50

//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------
extern __no_init BYTE g_byDownPowerTime;
extern BYTE DeltaTestNo;
extern WORD DeltaTest[];
extern WORD WakeUpCountNew;
extern WORD WakeUpCountOld;

//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
void ProcContinueFramWakeup( void );


#endif//#if( (CPU_TYPE == CPU_HC32F460) && (MAX_PHASE == 3) ) //暂时用cpu定义，可以考虑用单三相定义

#endif//#ifndef __F460_LOWPOWER_THREE_H

