//---------------------------------------------
// 恒定磁场干扰处理记录
//---------------------------------------------

#include "AllHead.h"

#if( SEL_EVENT_MAGNETIC_INT == YES )

static const DWORD MagneticOad[] =
{
#if( MAX_PHASE == 1)
	0x04,				// 个数
	0x00102201,    //恒定磁场干扰事件前正向有功总电能
	0x00202201,    //恒定磁场干扰事件前反向有功总电能
	0x00108201,    //恒定磁场干扰事件后正向有功总电能
	0x00208201     //恒定磁场干扰事件后反向有功总电能
#else
	0x04,				// 个数
	0x00102201,    //恒定磁场干扰事件前正向有功总电能
	0x00202201,    //恒定磁场干扰事件前反向有功总电能
	0x00108201,    //恒定磁场干扰事件后正向有功总电能
	0x00208201     //恒定磁场干扰事件后反向有功总电能
#endif
};

void FactoryInitMagneticPara( void )
{
	api_WriteEventAttribute( 0x302a, 0xFF, (BYTE *)&MagneticOad[0], sizeof(MagneticOad)/sizeof(DWORD) );
}

//------------------------------------------------------------------------------------------------------
// 各个事件处理专用部分－恒定磁场干扰
//------------------------------------------------------------------------------------------------------
// 判断恒定磁场干扰是否发生
BYTE GetMagneticStatus(BYTE Phase)
{
	//如果恒定磁场干扰已发生
	if( MAGNETIC_IS_OCCUR )
	{
		return 1;
	}

	return 0;

}

#endif//#if( SEL_EVENT_MAGNETIC_INT == YES )

