#ifndef __ROGOWSKI
#define __ROGOWSKI

#include "event.h"

//-----------------------------------------------
//				宏定义
//-----------------------------------------------

//-----------------------------------------------
//				结构体，共用体，枚举
//-----------------------------------------------

//-----------------------------------------------
//				变量声明
//-----------------------------------------------
extern BYTE bRogowskiChangeFlag,bRogowskiFailFlag;
//-----------------------------------------------
// 				函数声明
//-----------------------------------------------
//-----------------------------------------------
//函数功能: 初始化事件门限值,关联对象属性表
//
//参数: 无
//                    
//返回值:  	无
//
//备注:
//-----------------------------------------------
void FactoryInitRogowskiPara( void );
BYTE api_GetRogowskiChangEventStatus( BYTE Phase );
BYTE api_GetRogowskiFailEventStatus( BYTE Phase );
#endif//#ifndef __ROGOWSKI
